[
  {
    "id": 1,
    "thumbnail": "https://i.ibb.co/nmtkFrR/Rectangle-2.png",
    "course_name": "Python Object-Oriented Programming (OOP) Fundamentals",
    "description": "In this comprehensive course, you will master Python programming with a strong emphasis on Object-Oriented Programming (OOP) principles and best practices. Learn to design and build efficient, maintainable software using Python.",
    "price": 49,
    "credit_hour": 7
  },
  {
    "id": 2,
    "thumbnail": "https://i.ibb.co/sF7Rv1q/Rectangle-2-1.png",
    "course_name": "MySQL Database Management",
    "description": "Become an expert in MySQL database management with this hands-on course. Learn to create, query, and manage databases effectively, and gain valuable skills for data-driven applications.",
    "price": 59,
    "credit_hour": 4
  },
  {
    "id": 3,
    "thumbnail": "https://i.ibb.co/0rWxvcS/Rectangle-2-2.png",
    "course_name": "C Programming for Beginners",
    "description": "Start your programming journey with C programming. This beginner-friendly course covers the fundamentals of syntax, data types, and basic programming concepts, setting a solid foundation for your coding career.",
    "price": 79,
    "credit_hour": 9
  },
  {
    "id": 4,
    "thumbnail": "https://i.ibb.co/xFqzYZW/Rectangle-2-3.png",
    "course_name": "Algorithm Design and Analysis",
    "description": "Delve into the world of algorithms with this course. Explore algorithm design, analysis, and their practical application in solving complex problems. Sharpen your problem-solving skills.",
    "price": 69,
    "credit_hour": 6
  },
  {
    "id": 5,
    "thumbnail": "https://i.ibb.co/rF4cFmf/Rectangle-2-4.png",
    "course_name": "Advanced C++ Programming",
    "description": "Take your C++ skills to the next level. This course covers advanced topics such as pointers, memory management, and the Standard Template Library (STL). Gain expertise in C++ programming.",
    "price": 69,
    "credit_hour": 8
  },
  {
    "id": 6,
    "thumbnail": "https://i.ibb.co/sWH1H30/Rectangle-2-5.png",
    "course_name": "Software Engineering Principles",
    "description": "Become a proficient software engineer by learning industry best practices, design principles, and software development methodologies. Develop the skills needed for professional software development.",
    "price": 99,
    "credit_hour": 3
  },
  {
    "id": 7,
    "thumbnail": "https://i.ibb.co/9nvVtkW/Rectangle-2-6.png",
    "course_name": "Problem Solving in Programming",
    "description": "Enhance your problem-solving skills through a variety of real-world programming challenges and scenarios. Learn to tackle complex problems systematically and efficiently.",
    "price": 79,
    "credit_hour": 5
  },
  {
    "id": 8,
    "thumbnail": "https://i.ibb.co/mBWDNPy/Rectangle-3.png",
    "course_name": "Data Structures and Algorithms Mastery",
    "description": "Master data structures and algorithms with hands-on implementation in various programming languages. Gain the knowledge and skills required for efficient coding and problem-solving.",
    "price": 59,
    "credit_hour": 2
  },
  {
    "id": 9,
    "thumbnail": "https://i.ibb.co/hy29h6n/Rectangle-3-1.png",
    "course_name": "Amazon Web Services (AWS) Cloud Computing",
    "description": "Learn the ins and outs of Amazon Web Services (AWS) and become proficient in cloud infrastructure management. Acquire the skills needed for modern cloud computing solutions.",
    "price": 49,
    "credit_hour": 1
  }
]
